<a href="https://colab.research.google.com/github/abhi2896/Data_Science/blob/main/Pandas2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [22]:
import pandas as pd
import numpy as np

In [3]:
ser1 = pd.Series(data=[1,2,3,4,5], index=list('abcde'))

In [17]:
ser2 = pd.Series(data=[11,22,33,44,55], index=list('abcde'))   #even we can change the indexes

In [18]:
df = pd.DataFrame({'A':ser1, 'B':ser2})

In [19]:
df.head(2)

   A   B
a  1  11
b  2  22

In [23]:
pd.DataFrame(data=np.random.randint(1,10,size=(10,10)), index=list('ABCDEFGHIJ'), columns=list('abcdefghij'))

   a  b  c  d  e  f  g  h  i  j
A  2  9  9  2  5  2  1  7  8  1
B  6  8  8  9  7  1  7  1  4  4
C  3  8  9  3  7  7  3  2  6  5
D  5  9  8  2  3  6  3  4  9  8
E  3  9  4  9  5  2  5  6  9  4
F  4  5  8  7  9  6  3  1  8  9
G  9  1  6  3  2  3  9  4  7  2
H  2  1  6  3  6  5  4  6  7  8
I  5  8  6  6  6  6  7  5  7  6
J  4  9  2  5  8  9  3  3  7  3

#chunksize (chunksize=5000)

In [76]:
data = pd.read_csv('https://raw.githubusercontent.com/zekelabs/data-science-complete-tutorial/master/Data/HR_comma_sep.csv.txt')

In [77]:
data

       satisfaction_level  last_evaluation  ...    sales  salary
0                    0.38             0.53  ...    sales     low
1                    0.80             0.86  ...    sales  medium
2                    0.11             0.88  ...    sales  medium
3                    0.72             0.87  ...    sales     low
4                    0.37             0.52  ...    sales     low
...                   ...              ...  ...      ...     ...
14994                0.40             0.57  ...  support     low
14995                0.37             0.48  ...  support     low
14996                0.37             0.53  ...  support     low
14997                0.11             0.96  ...  support     low
14998                0.37             0.52  ...  support     low

[14999 rows x 10 columns]

In [78]:
data.shape              # not working beacause of chunksize=5000

(14999, 10)

In [79]:
data.columns

Index(['satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company', 'Work_accident', 'left',
       'promotion_last_5years', 'sales', 'salary'],
      dtype='object')

In [80]:
data

       satisfaction_level  last_evaluation  ...    sales  salary
0                    0.38             0.53  ...    sales     low
1                    0.80             0.86  ...    sales  medium
2                    0.11             0.88  ...    sales  medium
3                    0.72             0.87  ...    sales     low
4                    0.37             0.52  ...    sales     low
...                   ...              ...  ...      ...     ...
14994                0.40             0.57  ...  support     low
14995                0.37             0.48  ...  support     low
14996                0.37             0.53  ...  support     low
14997                0.11             0.96  ...  support     low
14998                0.37             0.52  ...  support     low

[14999 rows x 10 columns]

In [82]:
#data['satisfaction_level', 'last_evaluation']  = data["first", "second"]

In [83]:
data.value_counts()

satisfaction_level  last_evaluation  number_project  average_montly_hours  time_spend_company  Work_accident  left  promotion_last_5years  sales       salary
0.46                0.57             2               139                   3                   0              1     0                      sales       low       6
0.37                0.46             2               156                   3                   0              1     0                      sales       low       4
0.10                0.85             6               266                   4                   0              1     0                      sales       low       4
0.37                0.51             2               127                   3                   0              1     0                      sales       medium    4
0.42                0.53             2               142                   3                   0              1     0                      sales       low       4
                                                                                                                                                                ..
0.75                0.70             4               144                   4                   0              0     0                      technical   high      1
                                     3               129                   3                   0              0     0                      accounting  medium    1
                    0.69             3               274                   2                   0              0     0                      sales       medium    1
                                                     242                   3                   0              0     0                      sales       high      1
0.66                0.71             3               136                   3                   1              0     0                      technical   medium    1
Length: 11991, dtype: int64

In [95]:
data.salary.value_counts()

low       7316
medium    6446
high      1237
Name: salary, dtype: int64

In [96]:
data.isnull().sum()

satisfaction_level       0
last_evaluation          0
number_project           0
average_montly_hours     0
time_spend_company       0
Work_accident            0
left                     0
promotion_last_5years    0
sales                    0
salary                   0
dtype: int64

In [97]:
data.dtypes

satisfaction_level       float64
last_evaluation          float64
number_project             int64
average_montly_hours       int64
time_spend_company         int64
Work_accident              int64
left                       int64
promotion_last_5years      int64
sales                     object
salary                    object
dtype: object

Accessing subset of data - rows, columns, filters

In [98]:
cat_cols_data = data.select_dtypes('object')

In [99]:
cat_cols_data

         sales  salary
0        sales     low
1        sales  medium
2        sales  medium
3        sales     low
4        sales     low
...        ...     ...
14994  support     low
14995  support     low
14996  support     low
14997  support     low
14998  support     low

[14999 rows x 2 columns]

In [100]:
data.rename(columns={'sales':'department'},inplace=True)

In [101]:
data[['satisfaction_level','last_evaluation','number_project']].head()

   satisfaction_level  last_evaluation  number_project
0                0.38             0.53               2
1                0.80             0.86               5
2                0.11             0.88               7
3                0.72             0.87               5
4                0.37             0.52               2

In [104]:
data.satisfaction_level[:5]    # only gives first 5 values or data['satisfaction_level'][:5]

0    0.38
1    0.80
2    0.11
3    0.72
4    0.37
Name: satisfaction_level, dtype: float64

Handling missing data
Machine Learning algorithms don't expect data missing
If there is a columns with more than 40% data missing, we may drop the column
Fow rows with, important column values missing. Drop the rows

In [105]:
data

       satisfaction_level  last_evaluation  ...  department  salary
0                    0.38             0.53  ...       sales     low
1                    0.80             0.86  ...       sales  medium
2                    0.11             0.88  ...       sales  medium
3                    0.72             0.87  ...       sales     low
4                    0.37             0.52  ...       sales     low
...                   ...              ...  ...         ...     ...
14994                0.40             0.57  ...     support     low
14995                0.37             0.48  ...     support     low
14996                0.37             0.53  ...     support     low
14997                0.11             0.96  ...     support     low
14998                0.37             0.52  ...     support     low

[14999 rows x 10 columns]

In [108]:
data.notnull().sum()    # opposite of is null

satisfaction_level       14999
last_evaluation          14999
number_project           14999
average_montly_hours     14999
time_spend_company       14999
Work_accident            14999
left                     14999
promotion_last_5years    14999
department               14999
salary                   14999
dtype: int64

In [110]:
data[data['left'].notnull()]   # values which are not null

       satisfaction_level  last_evaluation  ...  department  salary
0                    0.38             0.53  ...       sales     low
1                    0.80             0.86  ...       sales  medium
2                    0.11             0.88  ...       sales  medium
3                    0.72             0.87  ...       sales     low
4                    0.37             0.52  ...       sales     low
...                   ...              ...  ...         ...     ...
14994                0.40             0.57  ...     support     low
14995                0.37             0.48  ...     support     low
14996                0.37             0.53  ...     support     low
14997                0.11             0.96  ...     support     low
14998                0.37             0.52  ...     support     low

[14999 rows x 10 columns]

In [111]:
data[data['left'].isnull()]

Empty DataFrame
Columns: [satisfaction_level, last_evaluation, number_project, average_montly_hours, time_spend_company, Work_accident, left, promotion_last_5years, department, salary]
Index: []

In [112]:
data.drop(['left'],axis=1,inplace=True)

In [113]:
data.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14999 entries, 0 to 14998
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   satisfaction_level     14999 non-null  float64
 1   last_evaluation        14999 non-null  float64
 2   number_project         14999 non-null  int64
 3   average_montly_hours   14999 non-null  int64
 4   time_spend_company     14999 non-null  int64
 5   Work_accident          14999 non-null  int64
 6   promotion_last_5years  14999 non-null  int64
 7   department             14999 non-null  object
 8   salary                 14999 non-null  object
dtypes: float64(2), int64(5), object(2)
memory usage: 1.1+ MB

In [115]:
data.dropna(subset=["time_spend_company",	"Work_accident"]).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14999 entries, 0 to 14998
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   satisfaction_level     14999 non-null  float64
 1   last_evaluation        14999 non-null  float64
 2   number_project         14999 non-null  int64
 3   average_montly_hours   14999 non-null  int64
 4   time_spend_company     14999 non-null  int64
 5   Work_accident          14999 non-null  int64
 6   promotion_last_5years  14999 non-null  int64
 7   department             14999 non-null  object
 8   salary                 14999 non-null  object
dtypes: float64(2), int64(5), object(2)
memory usage: 1.1+ MB

In [116]:
#data.fillna({'Age':0,'Embarked':'Unknown'}).info()
#data.Age.fillna(method='ffill')[:5]

Duplicate

In [117]:
#df[df.duplicated()]
#df[df.duplicated(subset=['A','B'])]

In [118]:
#data.groupby(['Sex']).Age.mean()
#data.groupby(['Sex']).Age.agg(['mean','min','max'])



#data.Age.rolling(window=5,min_periods=1).agg(['sum','min'])
#data[titanic_data.Name.str.contains('Mr')]

Append,Merge, Join & Concatenate

In [121]:
df1 = pd.DataFrame(data=np.random.randint(1,10,size=(10,3)), columns=list('ABC'))
df2 = pd.DataFrame(data=np.random.randint(1,10,size=(10,3)), columns=list('ABC'))

In [122]:
df1.append(df2, ignore_index=True)

    A  B  C
0   5  6  3
1   9  6  6
2   9  3  3
3   6  6  4
4   6  6  4
5   6  1  1
6   7  2  6
7   9  5  2
8   3  8  3
9   1  1  6
10  2  2  6
11  8  5  5
12  1  6  6
13  2  4  2
14  7  5  6
15  1  4  3
16  2  4  9
17  8  1  6
18  2  4  6
19  2  2  9

In [123]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3','K4','K5'],
                         'A': ['A0', 'A1', 'A2', 'A3','A4','A5'],
                         'B': ['B0', 'B1', 'B2', 'B3','B4','B5']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3','K6','K7'],
                          'C': ['C0', 'C1', 'C2', 'C3','C6','C7'],
                         'D': ['D0', 'D1', 'D2', 'D3','D6','D7']})

In [124]:
left.merge(right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [125]:
left.merge(right, on='key', how='left')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3
4  K4  A4  B4  NaN  NaN
5  K5  A5  B5  NaN  NaN

In [126]:
#join for combining data based on index values

In [127]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

In [128]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

PiVOT Table

In [129]:
sales_data = pd.read_excel('https://github.com/zekelabs/data-science-complete-tutorial/blob/master/Data/sales-funnel.xlsx?raw=true')

In [130]:
pd.pivot_table(sales_data, index=['Manager','Rep'], values=['Account','Price'], aggfunc=[np.sum, np.mean])

                                 sum              mean
                             Account   Price   Account         Price
Manager       Rep
Debra Henley  Craig Booker   2880948   80000  720237.0  20000.000000
              Daniel Hilton   584622  115000  194874.0  38333.333333
              John Smith     1152440   40000  576220.0  20000.000000
Fred Anderson Cedric Moss     784066  110000  196016.5  27500.000000
              Wendy Yule     2456246  177000  614061.5  44250.000000